import ujson as json
from py2neo import Graph
from NER import BiLSTM_CRF_NER,CRF_NER
graph = Graph(
    "http://localhost:7474",
    #username="Neo4j",
    #password="Neo4j"
)
e2t=json.load(open("./triple_data/e2t.json", "r", encoding="utf-8-sig"))
cn = BiLSTM_CRF_NER("predict","./NER/models/")
#cn = CRF_NER("predict","./NER/models/")

CA_LIST = {"事业单位":0,"应用领域":1,"政策技术":2,"技术特点":3,"事件地点":4,"事件时间":5,"问题挑战":6}
similar_words = {
    "应用":"应用于", "利用":"应用于", "运用":"应用于", "用处":"应用于",
    "政策":"关注执行", "工作":"关注执行","关注":"关注执行","执行":"关注执行", "施行":"关注执行","布局":"关注执行",
    "学习":"学习借鉴", "经验":"学习借鉴","借鉴":"学习借鉴","教导":"学习借鉴", "指导":"学习借鉴","学":"学习借鉴",
    "区别":"区别于", "不同":"区别于","差别":"区别于","差异":"分别", "不同于":"区别于","差":"区别于",
    "基础":"基础来源", "来源":"基础来源","来自":"基础来源","由来":"基础来源", "出处":"基础来源","根源":"基础来源",
    "哪里":"事件地点", "哪":"事件地点","地点":"事件地点","地方":"事件地点", "国家":"事件地点","国":"事件地点",
    "时候":"事件时间", "时间":"事件时间","年代":"事件时间","世纪":"事件时间", "年":"事件时间","月":"事件时间",
    "特点":"技术特点", "优点":"技术特点","优势":"技术特点","劣势":"技术特点", "缺点":"技术特点","优劣":"技术特点",
    "特征":"技术特点", "长短":"技术特点","短处":"技术特点","特色":"技术特点", "特别":"技术特点","长处":"技术特点",
    "什么":"技术特点",
    "问题":"问题挑战", "挑战":"问题挑战","解决":"问题挑战","困难":"问题挑战", "障碍":"问题挑战","疑难":"问题挑战",
}
